app/controllers/todos_controller.rb

SELECT "todos".* FROM "todos" ORDER BY created_at DESC
---
  def index
    todos = Todo.order("created_at DESC")

INSERT INTO "todos" ("title", "completed", "tag", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "meeting"], ["completed", 0], ["tag", "work"], ["created_at", "2019-12-29 21:30:18.451237"], ["updated_at", "2019-12-29 21:30:18.451237"]]
---
  def create
    todo = Todo.create(todo_param)

SELECT "todos".* FROM "todos" WHERE "todos"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
UPDATE "todos" SET "completed" = ?, "updated_at" = ? WHERE "todos"."id" = ?  [["completed", 1], ["updated_at", "2019-12-29 21:30:31.376133"], ["id", 15]]
---
  def update
    todo = Todo.find(params[:id])
    todo.update_attributes(todo_param)